import sys
input = sys.stdin.readline

N = int(input())  # 첫째 줄에 N(2 ≤ N ≤ 100)이 주어진다.

# 첫째 줄
print(''.join('*' * N + ' ' * (2 * N - 3) + '*' * N))

# 상단: 공백 증가 + 별 + 공백 + 공백 감소 + 별 + 공백 + 별
for u in range(N - 2):
    print(''.join(' ' * (u + 1) + '*' + ' ' * (N - 2) + '*' + ' ' * (2 * (N - u) - 5) + '*' + ' ' * (N - 2) + '*'))

# 가운데 줄
print(''.join(' ' * (N - 1) + '*' + ' ' * (N - 2) + '*' + ' ' * (N - 2) + '*'))

# 하단: 공백 감소 + 별 + 공백 + 공백 증가 + 별 + 공백 + 별
for d in range(N - 2):
    print(''.join(' ' * (N - d - 2) + '*' + ' ' * (N - 2) + '*' + ' ' * (2 * d + 1) + '*' + ' ' * (N - 2) + '*'))

# 마지막 줄
print(''.join('*' * N + ' ' * (2 * N - 3) + '*' * N))
